In [1]:
import pandas as pd

# Series

In [2]:
data = [1,2,3,4,5]
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
index = ['Linha ' + str(i) for i in range(5)]
index

['Linha 0', 'Linha 1', 'Linha 2', 'Linha 3', 'Linha 4']

In [4]:
s = pd.Series(data, index)
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [6]:
# Usando dicionário para mudar o rotulo do Index
data = {'Linha ' + str(i) : i + 1 for i in range(5)}
data

{'Linha 0': 1, 'Linha 1': 2, 'Linha 2': 3, 'Linha 3': 4, 'Linha 4': 5}

In [7]:
s = pd.Series(data)
s

Linha 0    1
Linha 1    2
Linha 2    3
Linha 3    4
Linha 4    5
dtype: int64

In [8]:
# Fazendo operações de calculo com Series
s1 = s + 3
s1

Linha 0    4
Linha 1    5
Linha 2    6
Linha 3    7
Linha 4    8
dtype: int64

In [9]:
s2 = s1 + s
s2

Linha 0     5
Linha 1     7
Linha 2     9
Linha 3    11
Linha 4    13
dtype: int64

## DataFrame

In [10]:
data = [[1,2,3],
        [4,5,5],
        [7,8,9]]
data

[[1, 2, 3], [4, 5, 5], [7, 8, 9]]

In [18]:
df1 = pd.DataFrame(data, index, columns)
df1

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         5
Linha 2         7         8         9

In [13]:
index = ['Linha ' + str(i) for i in range (3)]
index

['Linha 0', 'Linha 1', 'Linha 2']

In [20]:
df2 = pd.DataFrame(data, index, columns)
df2

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         5
Linha 2         7         8         9

In [21]:
columns = ['Coluna ' + str(i) for i in range (3)]
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [22]:
df3 = pd.DataFrame(data, index, columns)
df3

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         5
Linha 2         7         8         9

In [23]:
df1[df1 > 0] = 'A'
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [24]:
df2[df2 > 0] = 'B'
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [25]:
df3[df3 > 0] = 'C'
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [26]:
df4 = pd.concat([df1,df2,df3])
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [27]:
df4 = pd.concat([df1,df2,df3], axis = 1)
df4

,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2,Coluna 0,Coluna 1,Coluna 2
Linha 0,A,A,A,B,B,B,C,C,C
Linha 1,A,A,A,B,B,B,C,C,C
Linha 2,A,A,A,B,B,B,C,C,C